# Pandas

In [22]:
import pandas as pd
import numpy as np

data = pd.DataFrame({
    'groups':['A','B','C','D','E','F'],
    'total': [22,43,51,81,90,100],
    'kids': [2,1,3,1,1,2]
})
data

  groups  total  kids
0      A     22     2
1      B     43     1
2      C     51     3
3      D     81     1
4      E     90     1
5      F    100     2

In [24]:
data.iloc[4]

groups     E
total     90
kids       1
Name: 4, dtype: object

In [25]:
data.iloc[2]

groups     C
total     51
kids       3
Name: 2, dtype: object

In [41]:
data.iloc[2,-3]

'C'

In [46]:
data.iloc[:2]

  groups  total  kids
0      A     22     2
1      B     43     1

In [47]:
data.iloc[1:]

  groups  total  kids
1      B     43     1
2      C     51     3
3      D     81     1
4      E     90     1
5      F    100     2

In [50]:
data.iloc[:-2]

  groups  total  kids
0      A     22     2
1      B     43     1
2      C     51     3
3      D     81     1

In [55]:
data.iloc[2]

groups     C
total     51
kids       3
Name: 2, dtype: object

In [56]:
data.iloc[:0]

Empty DataFrame
Columns: [groups, total, kids]
Index: []

In [57]:
data.iloc[0:]

  groups  total  kids
0      A     22     2
1      B     43     1
2      C     51     3
3      D     81     1
4      E     90     1
5      F    100     2

In [64]:
data.iloc[1]

groups     B
total     43
kids       1
Name: 1, dtype: object

In [66]:
data.iloc[1,0]

'B'

In [67]:
data.iloc[1,1]

43

In [68]:
data.iloc[1,2]

1

In [75]:
data.iloc[1]

groups     B
total     43
kids       1
Name: 1, dtype: object

In [79]:
data.iloc[1,1:2]

total    43
Name: 1, dtype: object

In [82]:
list1 = [100,212,311,433,522,622,711]
list1[2:4]

[311, 433]

In [88]:
list1[-3]

522

In [89]:
list1[:3]

[100, 212, 311]

In [90]:
list1[:-3]

[100, 212, 311, 433]